<a href="https://colab.research.google.com/github/Ganapathi-tech/python-programming/blob/main/Pandas_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
d1 = {
    "Name" : ["AAA","BBB","CCC","DDD","EEE"],
    "cls" : [10,9,11,12,10],
    "English" : [88,77,66,78,72],
    "Science" : [78,87,76,72,74],
    "Maths" : [78,79,83,85,92]

}

In [ ]:
std1 = pd.DataFrame(d1, index=["std1","std2","std3","std4","std5"])

In [ ]:
std

     Name  cls  English  Science  Maths
std1  AAA   10       88       78     78
std2  BBB    9       77       87     79
std3  CCC   11       66       76     83
std4  DDD   12       78       72     85
std5  EEE   10       72       74     92

In [ ]:
std1["Total"] = std1["English"] + std1["Science"] + std1["Maths"]

In [ ]:
std1

     Name  cls  English  Science  Maths  Total
std1  AAA   10       88       78     78    244
std2  BBB    9       77       87     79    243
std3  CCC   11       66       76     83    225
std4  DDD   12       78       72     85    235
std5  EEE   10       72       74     92    238

In [ ]:
std1["Average"] = std1["Total"]/3

In [ ]:
std1

     Name  cls  English  Science  Maths  Total    Average
std1  AAA   10       88       78     78    244  81.333333
std2  BBB    9       77       87     79    243  81.000000
std3  CCC   11       66       76     83    225  75.000000
std4  DDD   12       78       72     85    235  78.333333
std5  EEE   10       72       74     92    238  79.333333

In [ ]:
std["Grade"] =  ["A+" if std["Average"] > 80 else  "A"  if  std["Average"] > 75 else "B"]

ValueError: ignored

In [ ]:
std

     Name  cls  English  Science  Maths  Total    Average
std1  AAA   10       88       78     78    244  81.333333
std2  BBB    9       77       87     79    243  81.000000
std3  CCC   11       66       76     83    225  75.000000
std4  DDD   12       78       72     85    235  78.333333
std5  EEE   10       72       74     92    238  79.333333

In [ ]:
std["Average"]

std1    81.333333
std2    81.000000
std3    75.000000
std4    78.333333
std5    79.333333
Name: Average, dtype: float64

In [ ]:
std["Average"][0]

81.33333333333333

In [ ]:
std["Average"][1]

81.0

In [ ]:
std["Grade"] = None

In [ ]:
std

     Name  cls  English  Science  Maths  Total    Average Grade
std1  AAA   10       88       78     78    244  81.333333  None
std2  BBB    9       77       87     79    243  81.000000  None
std3  CCC   11       66       76     83    225  75.000000  None
std4  DDD   12       78       72     85    235  78.333333  None
std5  EEE   10       72       74     92    238  79.333333  None

In [ ]:
for i in range(5):
  print(std["Average"][i])
  print(std["Grade"][i])

81.33333333333333
None
81.0
None
75.0
None
78.33333333333333
None
79.33333333333333
None

In [ ]:
for i in range(5):
  std["Grade"][i] = "A+" if std["Average"][i] > 80 else  "A"  if  std["Average"][i] > 75 else "B"

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [ ]:
std

     Name  cls  English  Science  Maths  Total    Average Grade
std1  AAA   10       88       78     78    244  81.333333    A+
std2  BBB    9       77       87     79    243  81.000000    A+
std3  CCC   11       66       76     83    225  75.000000     B
std4  DDD   12       78       72     85    235  78.333333     A
std5  EEE   10       72       74     92    238  79.333333     A

In [ ]:
cond = [(std["Average"] >= 80),
        (std["Average"] >= 75) & (std["Average"] < 80),
        (std["Average"] >=60) & (std["Average"] < 75),
      ]

In [ ]:
grade = ["A+","A","B"]

In [ ]:
std

     Name  cls  English  Science  Maths  Total    Average Grade
std1  AAA   10       88       78     78    244  81.333333    A+
std2  BBB    9       77       87     79    243  81.000000    A+
std3  CCC   11       66       76     83    225  75.000000     B
std4  DDD   12       78       72     85    235  78.333333     A
std5  EEE   10       72       74     92    238  79.333333     A

In [ ]:
import numpy as np

In [ ]:
std1["Grade"] =  np.select(cond, grade)

In [ ]:
std1

     Name  cls  English  Science  Maths  Total    Average Grade
std1  AAA   10       88       78     78    244  81.333333    A+
std2  BBB    9       77       87     79    243  81.000000    A+
std3  CCC   11       66       76     83    225  75.000000     A
std4  DDD   12       78       72     85    235  78.333333     A
std5  EEE   10       72       74     92    238  79.333333     A

In [ ]:
std

     Name  cls  English  Science  Maths  Total    Average Grade
std1  AAA   10       88       78     78    244  81.333333    A+
std2  BBB    9       77       87     79    243  81.000000    A+
std3  CCC   11       66       76     83    225  75.000000     A
std4  DDD   12       78       72     85    235  78.333333     A
std5  EEE   10       72       74     92    238  79.333333     A

In [ ]:
std['Total'].max()

244

In [ ]:
std.English.mean()

76.2

In [ ]:
std[["Name","English"]]

     Name  English
std1  AAA       88
std2  BBB       77
std3  CCC       66
std4  DDD       78
std5  EEE       72

In [ ]:
std.loc["std2"]

Name       BBB
cls          9
English     77
Science     87
Maths       79
Total      243
Average     81
Grade       A+
Name: std2, dtype: object

In [ ]:
std

     Name  cls  English  Science  Maths  Total    Average Grade
std1  AAA   10       88       78     78    244  81.333333    A+
std2  BBB    9       77       87     79    243  81.000000    A+
std3  CCC   11       66       76     83    225  75.000000     A
std4  DDD   12       78       72     85    235  78.333333     A
std5  EEE   10       72       74     92    238  79.333333     A

In [ ]:
std.iloc[0]

Name           AAA
cls             10
English         88
Science         78
Maths           78
Total          244
Average    81.3333
Grade           A+
Name: std1, dtype: object

In [ ]:
std

     Name  cls  English  Science  Maths  Total    Average Grade
std1  AAA   10       88       78     78    244  81.333333    A+
std2  BBB    9       77       87     79    243  81.000000    A+
std3  CCC   11       66       76     83    225  75.000000     A
std4  DDD   12       78       72     85    235  78.333333     A
std5  EEE   10       72       74     92    238  79.333333     A

In [ ]:
std.iloc[1:4]

     Name  cls  English  Science  Maths  Total    Average Grade
std2  BBB    9       77       87     79    243  81.000000    A+
std3  CCC   11       66       76     83    225  75.000000     A
std4  DDD   12       78       72     85    235  78.333333     A

In [ ]:
std.loc["std2": "std5"]

     Name  cls  English  Science  Maths  Total    Average Grade
std2  BBB    9       77       87     79    243  81.000000    A+
std3  CCC   11       66       76     83    225  75.000000     A
std4  DDD   12       78       72     85    235  78.333333     A
std5  EEE   10       72       74     92    238  79.333333     A

In [ ]:
std

     Name  cls  English  Science  Maths  Total    Average Grade
std1  AAA   10       88       78     78    244  81.333333    A+
std2  BBB    9       77       87     79    243  81.000000    A+
std3  CCC   11       66       76     83    225  75.000000     A
std4  DDD   12       78       72     85    235  78.333333     A
std5  EEE   10       72       74     92    238  79.333333     A

In [ ]:
std.iloc[[0,1,3]]

     Name  cls  English  Science  Maths  Total    Average Grade
std1  AAA   10       88       78     78    244  81.333333    A+
std2  BBB    9       77       87     79    243  81.000000    A+
std4  DDD   12       78       72     85    235  78.333333     A

In [ ]:
std

     Name  cls  English  Science  Maths  Total    Average Grade
std1  AAA   10       88       78     78    244  81.333333    A+
std2  BBB    9       77       87     79    243  81.000000    A+
std3  CCC   11       66       76     83    225  75.000000     A
std4  DDD   12       78       72     85    235  78.333333     A
std5  EEE   10       72       74     92    238  79.333333     A

In [ ]:
std[["Name","Total","Average","Grade"]]

     Name  Total    Average Grade
std1  AAA    244  81.333333    A+
std2  BBB    243  81.000000    A+
std3  CCC    225  75.000000     A
std4  DDD    235  78.333333     A
std5  EEE    238  79.333333     A

In [ ]:
std

     Name  cls  English  Science  Maths  Total    Average Grade
std1  AAA   10       88       78     78    244  81.333333    A+
std2  BBB    9       77       87     79    243  81.000000    A+
std3  CCC   11       66       76     83    225  75.000000     A
std4  DDD   12       78       72     85    235  78.333333     A
std5  EEE   10       72       74     92    238  79.333333     A

In [ ]:
std.loc[   :    ,   :   ]

     Name  cls  English  Science  Maths  Total    Average Grade
std1  AAA   10       88       78     78    244  81.333333    A+
std2  BBB    9       77       87     79    243  81.000000    A+
std3  CCC   11       66       76     83    225  75.000000     A
std4  DDD   12       78       72     85    235  78.333333     A
std5  EEE   10       72       74     92    238  79.333333     A

In [ ]:
std.loc[   :   , "English" : "Total" ]

      English  Science  Maths  Total
std1       88       78     78    244
std2       77       87     79    243
std3       66       76     83    225
std4       78       72     85    235
std5       72       74     92    238

In [ ]:
std_grade = std.loc[ : , ["Name","cls","Total","Average","Grade"]]

In [ ]:
std_grade

     Name  cls  Total    Average Grade
std1  AAA   10    244  81.333333    A+
std2  BBB    9    243  81.000000    A+
std3  CCC   11    225  75.000000     A
std4  DDD   12    235  78.333333     A
std5  EEE   10    238  79.333333     A

In [ ]:
std

     Name  cls  English  Science  Maths  Total    Average Grade
std1  AAA   10       88       78     78    244  81.333333    A+
std2  BBB    9       77       87     79    243  81.000000    A+
std3  CCC   11       66       76     83    225  75.000000     A
std4  DDD   12       78       72     85    235  78.333333     A
std5  EEE   10       72       74     92    238  79.333333     A

In [ ]:
del std["cls"]

In [ ]:
std

     Name  English  Science  Maths  Total    Average Grade
std1  AAA       88       78     78    244  81.333333    A+
std2  BBB       77       87     79    243  81.000000    A+
std3  CCC       66       76     83    225  75.000000     A
std4  DDD       78       72     85    235  78.333333     A
std5  EEE       72       74     92    238  79.333333     A

In [ ]:
std.pop("English")

std1    88
std2    77
std3    66
std4    78
std5    72
Name: English, dtype: int64

In [ ]:
std

     Name  Science  Maths  Total    Average Grade
std1  AAA       78     78    244  81.333333    A+
std2  BBB       87     79    243  81.000000    A+
std3  CCC       76     83    225  75.000000     A
std4  DDD       72     85    235  78.333333     A
std5  EEE       74     92    238  79.333333     A